#!/usr/bin/env python3
# -*- coding: utf-8 -*-

import unicodedata


import torch
import numpy as np
from transformers import AutoTokenizer
from transformers import BertForSequenceClassification, AdamW, BertConfig


def strip_accents_and_lowercase(s):
   return ''.join(c for c in unicodedata.normalize('NFD', s)
                  if unicodedata.category(c) != 'Mn').lower()
###############################################################################


def classify(text):
    """Get classification for text based on the loaded model"""
    tokenizer = AutoTokenizer.from_pretrained(
        "nlpaueb/bert-base-greek-uncased-v1")
    model = BertForSequenceClassification.from_pretrained(
        "nlpaueb/bert-base-greek-uncased-v1",
        num_labels=2,
        output_attentions=False,
        output_hidden_states=False,
    )
    model.load_state_dict(torch.load(
        'pytorch_model.bin', map_location=torch.device('cpu')))

    model.eval()
    with torch.no_grad():
        encoded_dict = tokenizer.encode_plus(
            strip_accents_and_lowercase(text),
            add_special_tokens=True,
            max_length=512,
            truncation=True,
            padding='max_length',
            return_attention_mask=True,
            return_tensors='pt'
        )

        prediction = model(
            encoded_dict['input_ids'],
            encoded_dict['attention_mask']
        )
        print("Sentence: '%s' is of type: %d (0: not fake, 1: fake)" %
              (text, np.argmax(prediction['logits']).flatten()[0]))

        if np.argmax(prediction['logits']).flatten()[0] == 0:
            return 'non_fake'
        else:
            return 'fake'
###############################################################################


def main():
    """main function"""
    tokenizer = AutoTokenizer.from_pretrained(
        "nlpaueb/bert-base-greek-uncased-v1")
    model = BertForSequenceClassification.from_pretrained(
        "nlpaueb/bert-base-greek-uncased-v1",
        num_labels=2,
        output_attentions=False,
        output_hidden_states=False,
    )
    model.load_state_dict(torch.load(
        'pytorch_model.bin', map_location=torch.device('cpu')))

    texts = [
        'Δελφίνια παρατηρήθηκαν να πετούν στην Μεσογείων.',
        'Την διακοπή της πώλησης γάλακτος από πτηνά μετά από 80 χρόνια ανακοίνωσε σήμερα η ΑΒ Βασιλόπουλος, ικανοποιώντας ένα πάγιο αίτημα φιλοζωικών οργανώσεων.Η απόφαση της ΑΒ Βασιλόπουλος να σταματήσει να προσφέρει γάλα πουλιών λήφθηκε μετά από πιέσεις που έχει δεχτεί από οικολογικές οργανώσεις, αλλά και τη χαμηλή ζήτηση για τα προϊόντα αυτά, καθώς οι καταναλωτές στρέφονται σε άλλα γαλακτοκομικά είδη.Ταυτόχρονα, η εταιρεία ανακοίνωσε ότι κλείνει τα αρμεκτήρια που διατηρούσε και αποσύρει το γνωστό σλόγκαν της «και του πουλιού το γάλα» προκειμένου να ενισχύσει το οικολογικό της προφίλ.Σας προτείνουμε:Όπως αναφέρει η ανακοίνωση, η εταιρεία θα δώσει πλέον έμφαση σε άλλα γαλακτοκομικά είδη, όπως το γάλα αμυγδάλου και το γάλα σόγιας, το άρμεγμα των οποίων δεν θεωρείται κακοποίηση σύμφωνα με τις οικολογικές οργανώσεις.Ικανοποίηση από την Greenpeace.Την ικανοποίηση της για την απόφαση της αλυσίδας σούπερ μάρκετ εξέφρασε και η οικολογική οργάνωση Greenpeace.«Μετά από πολλά χρόνια πιέσεων προς την συγκεκριμένη εταιρεία, κατά τη διάρκεια των οποίων αρμέχθηκαν παρά τη θέληση τους χιλιάδες ελληνικά πτηνά, η απόφαση αποτελεί σημαντική νίκη για μας» σημείωσε εκπρόσωπος της Greenpeace αναφερόμενος στην απόφαση.',
        'Ολοένα και πληθαίνουν οι εκκλήσεις προς τους γονείς παγκοσμίως να «παραμείνουν σε εγρήγορση, μετά από αναφορές για παιδιά και νέους που αντιγράφουν όσα βλέπουν στη νέα σειρά του Netflix Squid Game, που προορίζεται για θεατές άνω των 15 ετών», ενώ δεν είναι και λίγες οι χώρες που απαγορεύουν εξολοκλήρου τη σειρά σε όλες τις ηλικίες. Ο λόγος, σύμφωνα με πληροφορίες του «Κουλουριού», δεν έχει να κάνει με τις σκηνές βίας και τα επικίνδυνα παιχνίδια που εκτυλίσσονται στη σειρά, αλλά με τις πράσινες φόρμες πάνω-κάτω που φοράνε οι πρωταγωνιστές, και που οι ειδικοί φοβούνται πως η δημοφιλία της σειράς ίσως φέρει την παγκόσμια εξάπλωσή τους. «Όλοι είδαμε πως ό,τι κακό ξεκινάει στην Ασία, δυστυχώς φτάνει γρήγορα στον υπόλοιπο πλανήτη και μετά τρέχουμε. Αντέξαμε μια πανδημία, δεν μας παίρνει να αντέξουμε και εκατομμύρια κόσμου ντυμένου με πράσινες φόρμες πάνω-κάτω. Ας το προλάβουμε πριν να είναι αργά», σχολίαζε πηγή του ΟΗΕ, δίχως να μπορεί να κρύψει την ανησυχία του. Προς το παρόν, η σκέψη να απαγορευτεί η πώληση της φόρμας βρίσκεται υπό επεξεργασία, με το «Κουλούρι» να παρακολουθεί τις εξελίξεις και να επανέρχεται για οτιδήποτε νεότερο.',
        'Η εντυπωσιακή ιστορία της ελληνικής startup «Yugio» που έκλεισε πρόσφατα μια δεκαετία μέσα σε θερμοκοιτίδα μονοπώλησε το ενδιαφέρον στην τελευταία συνάντηση του Διοικητικού Συμβουλίου του ΕΒΕΑ, αφήνοντας με το στόμα ανοιχτό τα μέλη του. Η νεοφυής επιχείρηση «γεννήθηκε» τον Σεπτέμβριο του 2011 και αμέσως μπήκε στο εκκολαπτήριο προκειμένου να έχει όλη τη φροντίδα που χρειάζεται ώστε να αναπτυχθεί σωστά και με ασφάλεια. Έκτοτε παραμένει εκεί χωρίς διακοπή, καθώς δεν έχει φτάσει το «ειδικό βάρος» που απαιτείται για να βγει από τη θερμοκοιτίδα αλλά και ούτε έχει σταματήσει τη δραστηριοποίησή της στον χώρο του τροφίμου. Όπως επισημαίνουν τα στελέχη του επιμελητηρίου, πρόκειται για αξιοπερίεργη περίπτωση καθώς κατά μέσο όσο οι startups έχουν περίοδο επώασης από 18 έως 24 μήνες και ύστερα είτε βγαίνουν στην αγορά είτε «καταλήγουν». Κανείς δεν πίστευε ότι μια επιχείρηση μπορεί να επιζήσει για δέκα ολόκληρα χρόνια σε θερμοκοιτίδα και να παραμένει πλήρως λειτουργική, σε κανονικό μέγεθος για την ηλικία της και χωρίς κάποια μακροχρόνια δυσπλασία. «Η επιστήμη έχει προοδεύσει τόσο ώστε να είναι σε θέση να προσφέρει σε κάθε startup μια κανονική ζωή για πολλά χρόνια, μέσα σε περιβάλλον θερμοκοιτίδας», τονίζουν, «προσφέροντας χαρά και ελπίδα σε εκατοντάδες ιδρυτές και CEO». Από την πλευρά τους, οι ιδρυτές της Yugio, 35άρηδες πλέον Μιχάλης και Λευτέρης από την Άνω Πεύκη Αττικής δηλώνουν ευχαριστημένοι μεν από την ασφάλεια που τους παρέχεται, όμως θα ήθελαν πολύ να βγουν καθώς η ζέστη είναι αφόρητη και το έντονο φως τους προκαλεί οφθαλμολογικά προβλήματα.',
        'Επιθετικές και βίαιες συμπεριφορές είχε παρουσιάσει, κατά το παρελθόν, ο 40χρονος «σαμουράι» της Νέας Ερυθραίας, που πυροβόλησε  εν ψυχρώ δύο υπαλλήλους εγκατάστασης φυσικού αερίου, σκοτώνοντας τον έναν. Από τις μαρτυρίες γνωστών και γειτόνων προκύπτει ότι αντιμετώπιζε σοβαρά ψυχιατρικά προβλήματα, ενώ και πριν από το φονικό επεισόδιο είχε πυροβολήσει από την ταράτσα του. Ο λογαριασμός του, παράλληλα, στο Facebook δίνει αποκαλυπτικά στοιχεία για την προωπικότητά του: όπλα, σπαθιά, μαύρη μαγεία...Όπως αποκαλύπτουν, δε, γείτονές του ο 40χρονος φέρεται να κακοποιούσε τη μητέρα του.  Το τελευταίο χρονικό διάστημα, ο δράστης είχε ασχοληθεί και με σατανιστική οργάνωση στο εξωτερικό. «Έπρεπε να είναι εδώ και χρόνια στο ψυχιατρείο. Θα έπρεπε να έχουν μεριμνήσει κάποιοι έστω και παρά τη θέλησή του, να κλειστεί σε κλινική. Είχε παραισθήσεις. Έβλεπε να τον ζώνουν εκατοντάδες αράχνες. Όταν είχε νέα ψυχωσικά επεισόδια, εμμονές μπήκε για δεύτερη φορά στο ψυχιατρείο» ανέφερε οικογενειακός φίλος του «σαμουράι». ',
        'Υπάρχουν ματς που θεωρούνται διαδικαστικά. Από εκείνα που απλά πρέπει να τα πάρεις για να συνεχίσεις την πορεία σου. Ματς όπως αυτό του Βόλου όμως, είναι κάτι πολύ περισσότερο. Είναι από εκείνα που χτίζουν χαρακτήρα πρωταθλητή, που δείχνουν ποια είναι η δυναμική μιας ομάδας, που πείθουν – εαυτόν και αντιπάλους – πως μια ομάδα έχει τη στόφα της πρωταθλήτριας. Αυτό που έκανε η ΑΕΚ στο Βόλο, ήταν ξεκάθαρο μήνυμα πρωταθλητισμού. Αυτά που έκαναν στην ΑΕΚ στο Βόλο, είναι ξεκάθαρο μήνυμα πως οι έξω το έχουν κατανοήσει και προσπαθούν να τη σταματήσουν όπως μπορούν. Πριν αναφερθώ σε οτιδήποτε αγωνιστικό, θέλω να σταθώ στη διαιτησία. Επειδή καλό είναι το παραμυθάκι της εξυγίανσης και του ελέγχου της ΕΠΟ από τον Μελισσανίδη, αλλά έχει σταματήσει εδώ και πολύ καιρό να έχει δράκο. Μέχρι τώρα στο πρωτάθλημα, στο ματς που έχει υπάρξει αλλοίωση αποτελέσματος από διαιτητικές αλητείες, ήταν της ΑΕΚ στην Κρήτη. Και θα μπορούσε το επόμενο ματς να ήταν αυτό στο Βόλο, εάν ο Γιαννίκης δεν ήταν τόσο επιδραστικός, ώστε να κάνει το υλικό της ΑΕΚ να δείχνει την κλάση του.',
        'Στην γιορτή της Νέας Δημοκρατίας πέρασα και ευχαρίστησα τους εθελοντές μας για τον κόπο που έδωσαν για την Παράταξη μας. Οι Εσωκομματικές μας Εκλογές είχαν μεγάλη συμμετοχή και το ηθικό του κόσμου μας παντού ακμαίο. Πέρασα από τη Νέα Φιλαδέλφεια, το Χάλανδρι και τα Βριλήσσια',
        'Ο κ. Μητσοτάκης ολοένα και απομονώνεται. Βρίσκει πια συμμάχους μονάχα στα Ακροδεξιά. Η προοπτική της προοδευτικής διακυβέρνησης γίνεται ολοένα και πιο ρεαλιστική. Η νίκη του ΣΥΡΙΖΑ θα δώσει προοδευτική κυβέρνηση τη Δευτέρα των εκλογών με απλή αναλογική.'
    ]


    model.eval()
    with torch.no_grad():
        for text in texts:
            encoded_dict = tokenizer.encode_plus(
                strip_accents_and_lowercase(text),
                add_special_tokens=True,
                max_length=512,
                truncation=True,
                padding='max_length',
                return_attention_mask=True,
                return_tensors='pt'
            )

            prediction = model(
                encoded_dict['input_ids'],
                encoded_dict['attention_mask']
            )
            print("*"*100)
            print(prediction)
            print("Sentence: '%s' is of type: %d (0: not fake, 1: fake)" %
                  (text, np.argmax(prediction['logits']).flatten()[0]))
###############################################################################

if __name__ == '__main__':
    main()
